Revit 2027 API
BuiltInFailures.SpanDirectionSymbolFailures.NonPlanView Property
 Span Direction Symbol can only be placed in a Floor Plan View.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NonPlanView { get; }
Public Shared ReadOnly Property NonPlanView As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NonPlanView {
	FailureDefinitionId^ get ();
}
static member NonPlanView : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SpanDirectionSymbolFailures Class
Autodesk.Revit.DB Namespace